In [1]:
# %pip install reverse_geocoder

Defaulting to user installation because normal site-packages is not writeable
Collecting reverse_geocoder
  Downloading reverse_geocoder-1.5.1.tar.gz (2.2 MB)
     |████████████████████████████████| 2.2 MB 20.4 MB/s
  Preparing metadata (setup.py) ... done
Requirement already satisfied: numpy>=1.11.0 in /opt/tljh/user/lib/python3.9/site-packages (from reverse_geocoder) (1.23.4)
Requirement already satisfied: scipy>=0.17.1 in /opt/tljh/user/lib/python3.9/site-packages (from reverse_geocoder) (1.9.3)
Building wheels for collected packages: reverse-geocoder
  Building wheel for reverse-geocoder (setup.py) ... done
  Created wheel for reverse-geocoder: filename=reverse_geocoder-1.5.1-py3-none-any.whl size=2268087 sha256=96b76944392d022ca3f565ff64774cbe1d6abd14640b2ce5fa447cea3c19b549
  Stored in directory: /efs/home/jupyter-raffo/.cache/pip/wheels/10/05/be/d2edd4ff207cf625ce8bd20cf1493c27838828e8920aff9f4e
Successfully built reverse-geocoder
Installing collected packages: reverse-geocoder
Successfully installed reverse-geocoder-1.5.1
Note: you may need to restart the kernel to use updated packages.

# **Run after epsilon samples notebook !!!**

In [95]:
import reverse_geocoder as rg
import pandas as pd
import math

# PUBS

In [131]:
df = pd.read_csv('isp0313.csv')
df.head()

   year   lat   lng  tec       wgt
0  2003 -54.8 -68.3    1  3.500000
1  2003 -54.8 -68.3    2  0.250000
2  2003 -54.8 -68.3    4  0.500000
3  2003 -54.8 -68.3    5  3.845238
4  2003 -54.8 -68.3    7  0.250000

In [132]:
coordinates = list(df[['lat','lng']].itertuples(index=False, name=None))
# list(data_set.itertuples(index=False, name=None))
len(coordinates)

348280

In [133]:
coordcc = rg.search(coordinates)

In [134]:
len(coordcc   )

348280

In [135]:
dfcc = pd.DataFrame(coordcc)
dfcc.rename(columns={'lat':'adminlat', 'lon':'adminlng'}, inplace=True)
dfcc['adminlat'] = dfcc['adminlat'].astype(float)
dfcc['adminlng'] = dfcc['adminlng'].astype(float)
dfcc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348280 entries, 0 to 348279
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   adminlat  348280 non-null  float64
 1   adminlng  348280 non-null  float64
 2   name      348280 non-null  object
 3   admin1    348280 non-null  object
 4   admin2    348280 non-null  object
 5   cc        348280 non-null  object
dtypes: float64(2), object(4)
memory usage: 15.9+ MB

In [136]:
dfcc.head()

   adminlat  adminlng     name            admin1 admin2  cc
0     -54.8     -68.3  Ushuaia  Tierra del Fuego         AR
1     -54.8     -68.3  Ushuaia  Tierra del Fuego         AR
2     -54.8     -68.3  Ushuaia  Tierra del Fuego         AR
3     -54.8     -68.3  Ushuaia  Tierra del Fuego         AR
4     -54.8     -68.3  Ushuaia  Tierra del Fuego         AR

In [137]:
dfgeoinpoly = pd.concat((df, dfcc), axis=1)

In [139]:
dfgeoinpoly.head()

,year,lat,lng,tec,wgt,adminlat,adminlng,name,admin1,admin2,cc
0,2003,-54.8,-68.3,1,3.500000,-54.8,-68.3,Ushuaia,Tierra del Fuego,,AR
1,2003,-54.8,-68.3,2,0.250000,-54.8,-68.3,Ushuaia,Tierra del Fuego,,AR
2,2003,-54.8,-68.3,4,0.500000,-54.8,-68.3,Ushuaia,Tierra del Fuego,,AR
3,2003,-54.8,-68.3,5,3.845238,-54.8,-68.3,Ushuaia,Tierra del Fuego,,AR
4,2003,-54.8,-68.3,7,0.250000,-54.8,-68.3,Ushuaia,Tierra del Fuego,,AR

In [140]:
dfgeoinpoly.to_csv('isp0313.csv', index=False)

In [141]:
dfgeoinpoly['diff']=((dfgeoinpoly.lat-dfgeoinpoly.adminlat)**2+(dfgeoinpoly.lng-dfgeoinpoly.adminlng)**2)**.5

In [142]:
dfgeoinpoly['diff'].describe()

count    348280.000000
mean          0.027889
std           0.111290
min           0.000000
25%           0.000050
50%           0.014880
75%           0.035484
max          29.976512
Name: diff, dtype: float64

In [143]:
dfgeoinpoly[dfgeoinpoly['diff']>10].head(20)

,year,lat,lng,tec,wgt,adminlat,adminlng,name,admin1,admin2,cc,diff
137701,2003,79.6218,-76.7765,1,0.750000,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
137702,2003,79.6218,-76.7765,5,2.733333,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
137703,2003,79.6218,-76.7765,9,0.250000,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
137704,2013,-89.9976,139.2729,9,0.333333,-77.84600,166.67600,McMurdo Station,,,AQ,29.976512
348274,2013,79.6218,-76.7765,1,0.672222,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
348275,2013,79.6218,-76.7765,2,0.062500,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
348276,2013,79.6218,-76.7765,5,1.688889,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
348277,2013,79.6218,-76.7765,7,0.201389,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
348278,2013,79.6218,-76.7765,10,3.875000,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688
348279,2013,79.6218,-76.7765,12,0.125000,70.46916,-68.59143,Clyde River,Nunavut,,CA,12.278688

In [144]:
dfgeoinpoly[dfgeoinpoly['diff']>.5].groupby(['cc'])['wgt'].sum()

cc
AQ      0.333333
AR      6.433333
AU     23.636483
BO      0.142857
BR     19.349237
CA     96.154799
CL     10.912495
CN     26.547330
IN      2.309524
IS      1.702381
JP     10.525000
KR      1.000000
MX      3.202381
NO      1.092857
NZ     15.694171
PK      0.583333
RU      9.144444
SA    491.970885
US     41.989333
VE      0.166667
ZA      6.033333
Name: wgt, dtype: float64

In [145]:
dfgeoinpoly[dfgeoinpoly['diff']>.1]['wgt'].sum()

38247.6836464765

In [146]:
dfgeoinpoly[dfgeoinpoly['diff']<=.1]['wgt'].sum()

2345399.337000981

# Pats (35 tecs)

In [119]:
df = pd.read_csv('ipf0313.csv')
df.head()

   year       lat        lng   tec       wgt
0  2003 -46.40000  168.35001  1409  0.250000
1  2003 -46.40000  168.35001  3220  0.250000
2  2003 -46.23148  169.75117  3429  0.500000
3  2003 -46.23148  169.75117  4125  0.500000
4  2003 -46.13330  167.68300  4227  0.166667

In [120]:
coordinates = list(df[['lat','lng']].itertuples(index=False, name=None))
# list(data_set.itertuples(index=False, name=None))
len(coordinates)

978056

In [121]:
coordcc = rg.search(coordinates)

In [122]:
len(coordcc   )

978056

In [123]:
dfcc = pd.DataFrame(coordcc)
dfcc.rename(columns={'lat':'adminlat', 'lon':'adminlng'}, inplace=True)
dfcc['adminlat'] = dfcc['adminlat'].astype(float)
dfcc['adminlng'] = dfcc['adminlng'].astype(float)
dfcc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 978056 entries, 0 to 978055
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   adminlat  978056 non-null  float64
 1   adminlng  978056 non-null  float64
 2   name      978056 non-null  object
 3   admin1    978056 non-null  object
 4   admin2    978056 non-null  object
 5   cc        978056 non-null  object
dtypes: float64(2), object(4)
memory usage: 44.8+ MB

In [127]:
dfcc.head()

   adminlat   adminlng          name     admin1              admin2  cc
0 -46.40000  168.35000  Invercargill  Southland   Invercargill City  NZ
1 -46.40000  168.35000  Invercargill  Southland   Invercargill City  NZ
2 -46.23389  169.75000     Balclutha      Otago     Clutha District  NZ
3 -46.23389  169.75000     Balclutha      Otago     Clutha District  NZ
4 -46.35000  168.01667      Riverton  Southland  Southland District  NZ

In [125]:
dfgeoinpoly = pd.concat((df, dfcc), axis=1)

In [126]:
dfgeoinpoly.head()

,year,lat,lng,tec,wgt,adminlat,adminlng,name,admin1,admin2,cc
0,2003,-46.40000,168.35001,1409,0.250000,-46.40000,168.35000,Invercargill,Southland,Invercargill City,NZ
1,2003,-46.40000,168.35001,3220,0.250000,-46.40000,168.35000,Invercargill,Southland,Invercargill City,NZ
2,2003,-46.23148,169.75117,3429,0.500000,-46.23389,169.75000,Balclutha,Otago,Clutha District,NZ
3,2003,-46.23148,169.75117,4125,0.500000,-46.23389,169.75000,Balclutha,Otago,Clutha District,NZ
4,2003,-46.13330,167.68300,4227,0.166667,-46.35000,168.01667,Riverton,Southland,Southland District,NZ

In [128]:
dfgeoinpoly.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 978056 entries, 0 to 978055
Data columns (total 11 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   year      978056 non-null  int64
 1   lat       978056 non-null  float64
 2   lng       978056 non-null  float64
 3   tec       978056 non-null  int64
 4   wgt       978056 non-null  float64
 5   adminlat  978056 non-null  float64
 6   adminlng  978056 non-null  float64
 7   name      978056 non-null  object
 8   admin1    978056 non-null  object
 9   admin2    978056 non-null  object
 10  cc        978056 non-null  object
dtypes: float64(5), int64(2), object(4)
memory usage: 82.1+ MB

In [130]:
dfgeoinpoly.to_csv('ipf0313.csv', index=False)

# pats (12 subsectors)

In [147]:
df = pd.read_csv('ipf0313tec2.csv')
df.head()

   year       lat        lng  tec2       wgt
0  2003 -46.40000  168.35001    14  0.250000
1  2003 -46.40000  168.35001    32  0.250000
2  2003 -46.23148  169.75117    34  0.500000
3  2003 -46.23148  169.75117    41  0.500000
4  2003 -46.13330  167.68300    42  0.333333

In [148]:
coordinates = list(df[['lat','lng']].itertuples(index=False, name=None))
# list(data_set.itertuples(index=False, name=None))
len(coordinates)

691976

In [149]:
coordcc = rg.search(coordinates)

In [150]:
len(coordcc   )

691976

In [151]:
dfcc = pd.DataFrame(coordcc)
dfcc.rename(columns={'lat':'adminlat', 'lon':'adminlng'}, inplace=True)
dfcc['adminlat'] = dfcc['adminlat'].astype(float)
dfcc['adminlng'] = dfcc['adminlng'].astype(float)
dfcc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 691976 entries, 0 to 691975
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   adminlat  691976 non-null  float64
 1   adminlng  691976 non-null  float64
 2   name      691976 non-null  object
 3   admin1    691976 non-null  object
 4   admin2    691976 non-null  object
 5   cc        691976 non-null  object
dtypes: float64(2), object(4)
memory usage: 31.7+ MB

In [127]:
dfcc.head()

   adminlat   adminlng          name     admin1              admin2  cc
0 -46.40000  168.35000  Invercargill  Southland   Invercargill City  NZ
1 -46.40000  168.35000  Invercargill  Southland   Invercargill City  NZ
2 -46.23389  169.75000     Balclutha      Otago     Clutha District  NZ
3 -46.23389  169.75000     Balclutha      Otago     Clutha District  NZ
4 -46.35000  168.01667      Riverton  Southland  Southland District  NZ

In [152]:
dfgeoinpoly = pd.concat((df, dfcc), axis=1)

In [153]:
dfgeoinpoly.head()

,year,lat,lng,tec2,wgt,adminlat,adminlng,name,admin1,admin2,cc
0,2003,-46.40000,168.35001,14,0.250000,-46.40000,168.35000,Invercargill,Southland,Invercargill City,NZ
1,2003,-46.40000,168.35001,32,0.250000,-46.40000,168.35000,Invercargill,Southland,Invercargill City,NZ
2,2003,-46.23148,169.75117,34,0.500000,-46.23389,169.75000,Balclutha,Otago,Clutha District,NZ
3,2003,-46.23148,169.75117,41,0.500000,-46.23389,169.75000,Balclutha,Otago,Clutha District,NZ
4,2003,-46.13330,167.68300,42,0.333333,-46.35000,168.01667,Riverton,Southland,Southland District,NZ

In [154]:
dfgeoinpoly.to_csv('ipf0313tec2.csv', index=False)

In [155]:
!ls -lash

total 1016M
4.0K drwxr-xr-x 4 jupyter-raffo jupyter-raffo 6.0K Jan  4 16:50  .
4.0K drwxr-xr-x 4 jupyter-raffo jupyter-raffo 6.0K Dec  9 07:20  ..
4.0K drwxr-xr-x 2 jupyter-raffo jupyter-raffo 6.0K Jan  4 14:36  .ipynb_checkpoints
1.1M -rw-r--r-- 1 jupyter-raffo jupyter-raffo 1.1M Jan  4 14:15 'Density figures.ipynb'
860K -rw-r--r-- 1 jupyter-raffo jupyter-raffo 860K Jan  2 09:36 'Epsilon figures.ipynb'
 60K -rw-r--r-- 1 jupyter-raffo jupyter-raffo  58K Jan  2 09:18 'Epsilon samples.ipynb'
1.2M -rw-r--r-- 1 jupyter-raffo jupyter-raffo 1.2M Jan  3 16:28 'WLD and FR samples by year.ipynb'
1.1M -rw-r--r-- 1 jupyter-raffo jupyter-raffo 1.1M Dec 31 01:19 'WLD and FR samples.ipynb'
 56K -rw-r--r-- 1 jupyter-raffo jupyter-raffo  56K Jan  4 16:50  geoinpoly.ipynb
 91M -rw-r--r-- 1 jupyter-raffo jupyter-raffo  91M Jan  4 16:46  ipf0313.csv
 63M -rw-r--r-- 1 jupyter-raffo jupyter-raffo  63M Jan  4 16:50  ipf0313tec2.csv
 29M -rw-r--r-- 1 jupyter-raffo jupyter-raffo  29M Jan  4 16:48  isp0313.csv
4.0K drwxr-xr-x 3 jupyter-raffo jupyter-raffo 6.0K Dec 29 17:54  tests
831M -rw-rw---- 1 jupyter-raffo jupyter-raffo 831M Jun 29  2022  toolpaper.zip